{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 60],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} }
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "rate": 0.3,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 256,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} }
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "rate": 0.4,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} }
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_2",
              "trainable": true,
              "rate": 0.3,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} }
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_3",
              "trainable": true,
              "rate": 0.2,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} }
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_4",
              "trainable": true,
              "rate": 0.1,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} }
            }
          }
        ]
      }
    }
  },
  "training_config": {
    "loss": "sparse_categorical_crossentropy",
    "metrics": ["accuracy"],
    "optimizer_config": {
      "class_name": "Adam",
      "config": { "name": "adam", "learning_rate": 9.765625e-7 }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        { "name": "dense/kernel", "shape": [60, 128], "dtype": "float32" },
        { "name": "dense/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [128, 256], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [256], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [256, 128], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_4/kernel", "shape": [64, 32], "dtype": "float32" },
        { "name": "dense_4/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_5/kernel", "shape": [32, 16], "dtype": "float32" },
        { "name": "dense_5/bias", "shape": [16], "dtype": "float32" }
      ]
    }
  ]
}
